app/controllers/stations_controller.rb

	def index
		ip = request.remote_ip
		if ip == "127.0.0.1"
			ip = "130.64.185.219"
		end
		@user_location = MultiGeocoder.geocode(ip)
		@closest_station = Stations.geo_scope(:origin => [@user_location.lat, @user_location.lng], :within => 3).order('distance asc').first
		@all_stations = Stations.all.uniq_by {|h| h.stop_id}
---
SELECT `stations`.* FROM `stations`

	def station
		@Station = Stations.where('stop_id = ?',params[:stop_id])
---
SELECT `stations`.* FROM `stations` WHERE (stop_id = 'place-portr')

	def station_schedule
		stations = Stations.where('stop_id = ?', params[:stop_id]).select("stop_name, platformkey, direction, stop_lat, stop_lon, stop_id")

		#HTTP request
		results = Array.new
		response_red = Net::HTTP.get_response(URI.parse("http://developer.mbta.com/Data/red.json")).body
		response_blue = Net::HTTP.get_response(URI.parse("http://developer.mbta.com/Data/blue.json")).body
		response_orange = Net::HTTP.get_response(URI.parse("http://developer.mbta.com/Data/orange.json")).body
		result_red = JSON.parse(response_red)
		result_blue = JSON.parse(response_blue)
		result_orange = JSON.parse(response_orange)
		results.concat(result_red)
		results.concat(result_blue)
		results.concat(result_orange)

		#organize external API
		station_info = Array.new
		stations.each do |station|
---
SELECT stop_name, platformkey, direction, stop_lat, stop_lon, stop_id FROM `stations` WHERE (stop_id = 'place-dwnxg')
SELECT `stations`.* FROM `stations` WHERE (stop_id = 'place-potr')